ONVIF/testONVIFrequest.html

<html>
<header>
<script src="./jquery-3.3.1.js"></script>
</header>

<body>
<div id="sub"></div>
<script>
	let soapDateTime = '<s:Envelope xmlns:s="http://www.w3.org/2003/05/soap-envelope">' +
									  '<s:Body xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema">'+
									  '<GetSystemDateAndTime xmlns="http://www.onvif.org/ver10/device/wsdl"/>'+
					 				  '</s:Body>'+
									  '</s:Envelope>';
									  
	let soapServices = 
		'<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope" xmlns:wsdl="http://www.onvif.org/ver10/device/wsdl">'+
	   		'<soap:Header/>'+
	   		'<soap:Body>'+
		     	'<wsdl:GetCapabilities>'+
			         '<!--Zero or more repetitions:-->'+
					 '<!--enum { All, Analytics, Device, Events, Imaging, Media, PTZ }-->'+
			         '<wsdl:Category>PTZ</wsdl:Category>'+
					 '<wsdl:Category>Media</wsdl:Category>'+
					 '<wsdl:Category>Events</wsdl:Category>'+
		      	'</wsdl:GetCapabilities>'+
	   		'</soap:Body>'	+
		'</soap:Envelope>'
									  
		let soapDiscoveryMode = '<s:Envelope xmlns:s="http://www.w3.org/2003/05/soap-envelope">' +
									  '<s:Body xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema">'+
									  '<GetDiscoveryMode  xmlns="http://www.onvif.org/ver10/device/wsdl"/>'+
					 				  '</s:Body>'+
									  '</s:Envelope>';
									  
	let createPullPointSubscription = 
	'<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope" xmlns:wsdl="http://www.onvif.org/ver10/events/wsdl">'+
   	'<soap:Header/>'+
   '<soap:Body>'+
      '<wsdl:CreatePullPointSubscription>'+
         '<!--Optional:-->'+
         '<wsdl:Filter>'+
            '<!--You may enter ANY elements at this point-->'+
         '</wsdl:Filter>'+
         '<!--Optional:-->'+
         '<wsdl:InitialTerminationTime>PT10M</wsdl:InitialTerminationTime>'+
         '<!--Optional:-->'+
         '<wsdl:SubscriptionPolicy>'+
            '<!--You may enter ANY elements at this point-->'+
         '</wsdl:SubscriptionPolicy>'+
        '<!--You may enter ANY elements at this point-->'+
      '</wsdl:CreatePullPointSubscription>'+
   '</soap:Body>'+
'</soap:Envelope>';

let getMessage= 
'<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope" xmlns:wsdl="http://www.onvif.org/ver10/events/wsdl">'+
   '<soap:Header/>'+
  ' <soap:Body>'+
     ' <wsdl:PullMessages>'+
         '<wsdl:Timeout>PT50S</wsdl:Timeout>'+
         '<wsdl:MessageLimit>10</wsdl:MessageLimit>'+
         '<!--You may enter ANY elements at this point-->'+
     ' </wsdl:PullMessages>'+
  ' </soap:Body>'+
'</soap:Envelope>';
			
									  
	let ipAdd = '192.168.1.230';
	let port = 80;
	let path = '/onvif/device_service';
	let pathEvent ='/onvif/Events';
	let dataResponse;
	let UrlEvents;

	//let url = `http://${ipAdd}:${port}${path}`;
	let urlStart = `http://${ipAdd}:${port}${pathEvent}`;
	
	/*$.ajax(
	{
	  type : 'POST',
	  url,
	  contentType : 'text/xml; charset="utf-8"',
	  dataType: "xml",
	  processData: false,
	  data 	: soapServices,
	  success : processSuccess,
	  error 	: processError	
	});*/
	
	$.ajax(
	{
	  url: urlStart,
	  type : 'POST',
	  contentType : 'text/xml; charset="utf-8"',
	  dataType: "xml",
	  processData: false,
	  data 	: createPullPointSubscription,
	  success : processSuccessSub,
	  error 	: processError	
	});

	function processSuccess(data, status, req) {
	  console.log( 'SUCCESS' );
	}
	
	function processSuccessSub(data, status, req) {
	  console.log( 'SUCCESS processSuccessSub' );
	  dataResponse = $(data);
	  console.log(data.toString());
	  UrlEvents=  dataResponse[0].all[6].innerHTML;
	  console.log(dataResponse[0].all[6].innerHTML);
	  secondAjax();
	
	}
	
	function secondAjax(){
	console.log("second url: " + UrlEvents);
	$.ajax(
	{
	  type : 'POST',
	  url: UrlEvents,
	  contentType : 'text/xml; charset="utf-8"',
	  dataType: "xml",
	  processData: false,
	  data 	: getMessage,
	  success :  processSuccessMessage,
	  error 	: processErrorMessage
	});
	}
	function processError(data, status, req) {
	  console.log( 'ERROR' );
	  //console.log( req );
	  console.log( data )
	}
	
	function processSuccessMessage(data, status, req){
		console.log( 'SUCCESS MESSAGE' );
		//console.log(url)
		console.log(req);
		//console.log(status);
		console.log($(data));
	}
	
	function processErrorMessage(data, status, req){
		console.log( 'ERROR MESSAGE' );
		console.log(data);
		
		
	}
	
</script>
</body>

</html>




